## Staging: app
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 5 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.cron_4am_every_day will be created
  + resource "aws_cloudwatch_event_rule" "cron_4am_every_day" {
      + arn                 = (known after apply)
      + description         = "Fires every day at 4am EST"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "every-day-at-4am"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 9 * * ? *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.run_dead_letter_queue_consumer_lambda_every_day will be created
  + resource "aws_cloudwatch_event_target" "run_dead_letter_queue_consumer_lambda_every_day" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "every-day-at-4am"
      + target_id      = (known after apply)
    }

  # aws_lambda_function.dead_letter_queue_consumer will be created
  + resource "aws_lambda_function" "dead_letter_queue_consumer" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/dead_letter_queue_consumer_main.zip"
      + function_name                  = "DeadLetterQueueConsumer"
      + handler                        = "dead_letter_queue_consumer.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::687401027353:role/iam_for_lambda"
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "HXfNyqHknkR0eHdJmK4/0YSMFiIWQB5uUqKx+bD7zyA="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "REGION"                              = "ca-central-1"
              + "SNS_ERROR_TOPIC_ARN"                 = "arn:aws:sns:ca-central-1:687401027353:alert-critical"
              + "SQS_DEAD_LETTER_QUEUE_URL"           = ""
              + "SQS_SUBMISSION_PROCESSING_QUEUE_URL" = "https://sqs.ca-central-1.amazonaws.com/687401027353/submission_processing.fifo"
            }
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_layer_version.dead_letter_queue_consumer_lib will be created
  + resource "aws_lambda_layer_version" "dead_letter_queue_consumer_lib" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "nodejs14.x",
        ]
      + created_date                = (known after apply)
      + filename                    = "/tmp/dead_letter_queue_consumer_lib.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "dead_letter_queue_consumer_node_packages"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = "NG3HGLvbdM+GBbJ3EVnPXZCSkYm/78Yb64HjUot+S6g="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # aws_lambda_permission.allow_cloudwatch_to_run_dead_letter_queue_consumer_lambda will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_to_run_dead_letter_queue_consumer_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "DeadLetterQueueConsumer"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_4am_every_day"]

18 tests, 17 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
